In [1]:
import pandas as pd

# exersies_1

In [12]:
authors = pd.DataFrame({'author_id':[1, 2, 3],
           'author_name':['Turgenev', 'Chekhov', 'Ostrovsky']}, columns=['author_id', 'author_name'])

In [13]:
authors

   author_id author_name
0          1    Turgenev
1          2     Chekhov
2          3   Ostrovsky

In [15]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                     'book_title':['Fathers and Sons', 'Rudin', 'Nest of Nobility', 'Thick and Thin', 'Lady with a Dog', 'Thunderstorm', 'Talents and Admirers'],
                     'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id','book_title','price'])

In [16]:
book

   author_id            book_title  price
0          1      Fathers and Sons    450
1          1                 Rudin    300
2          1      Nest of Nobility    350
3          2        Thick and Thin    500
4          2       Lady with a Dog    450
5          3          Thunderstorm    370
6          3  Talents and Admirers    290

# exersies_2

In [19]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

In [20]:
authors_price

   author_id author_name            book_title  price
0          1    Turgenev      Fathers and Sons    450
1          1    Turgenev                 Rudin    300
2          1    Turgenev      Nest of Nobility    350
3          2     Chekhov        Thick and Thin    500
4          2     Chekhov       Lady with a Dog    450
5          3   Ostrovsky          Thunderstorm    370
6          3   Ostrovsky  Talents and Admirers    290

# exersies_3

In [22]:
top5 = authors_price.nlargest(5,'price')

In [24]:
top5

   author_id author_name        book_title  price
3          2     Chekhov    Thick and Thin    500
0          1    Turgenev  Fathers and Sons    450
4          2     Chekhov   Lady with a Dog    450
5          3   Ostrovsky      Thunderstorm    370
2          1    Turgenev  Nest of Nobility    350

# exersies_4
#### Мне не нравятся эти решения

In [166]:
authors_stat = pd.DataFrame({'author_name':authors_price.groupby('author_name')['author_name'].unique(), 
                'min_price':authors_price.groupby('author_name').agg({'price':'min'})['price'].unique(),
               'max_price':authors_price.groupby('author_name').agg({'price':'max'})['price'].unique(),
               'mean_price':authors_price.groupby('author_name').agg({'price':'mean'})['price'].unique()},
                            columns=['author_name','min_price','max_price','mean_price'])

In [167]:
authors_stat

             author_name  min_price  max_price  mean_price
author_name
Chekhov        [Chekhov]        450        500  475.000000
Ostrovsky    [Ostrovsky]        290        370  330.000000
Turgenev      [Turgenev]        300        450  366.666667

In [172]:
pd.merge(pd.merge(authors_price.groupby('author_name').agg({'price':'min'})['price'],
         authors_price.groupby('author_name').agg({'price':'max'})['price'], on='author_name', how='inner'),
authors_price.groupby('author_name').agg({'price':'mean'})['price'], on='author_name', how='inner')

             price_x  price_y       price
author_name
Chekhov          450      500  475.000000
Ostrovsky        290      370  330.000000
Turgenev         300      450  366.666667